MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4402-F100K256/mcu.h
/* ------------------------------  HRPWM0_CSG_ISTAT  ------------------------------ */
#define HRPWM0_CSG_ISTAT_VLS1S_Pos            (0UL)                     /*!< HRPWM0_CSG ISTAT: VLS1S (Bit 0)                             */
#define HRPWM0_CSG_ISTAT_VLS1S_Msk            (0x1UL)                   /*!< HRPWM0_CSG ISTAT: VLS1S (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG_ISTAT_VLS2S_Pos            (1UL)                     /*!< HRPWM0_CSG ISTAT: VLS2S (Bit 1)                             */
#define HRPWM0_CSG_ISTAT_VLS2S_Msk            (0x2UL)                   /*!< HRPWM0_CSG ISTAT: VLS2S (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG_ISTAT_TRGSS_Pos            (2UL)                     /*!< HRPWM0_CSG ISTAT: TRGSS (Bit 2)                             */
#define HRPWM0_CSG_ISTAT_TRGSS_Msk            (0x4UL)                   /*!< HRPWM0_CSG ISTAT: TRGSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG_ISTAT_STRSS_Pos            (3UL)                     /*!< HRPWM0_CSG ISTAT: STRSS (Bit 3)                             */
#define HRPWM0_CSG_ISTAT_STRSS_Msk            (0x8UL)                   /*!< HRPWM0_CSG ISTAT: STRSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG_ISTAT_STPSS_Pos            (4UL)                     /*!< HRPWM0_CSG ISTAT: STPSS (Bit 4)                             */
#define HRPWM0_CSG_ISTAT_STPSS_Msk            (0x10UL)                  /*!< HRPWM0_CSG ISTAT: STPSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG_ISTAT_STDS_Pos             (5UL)                     /*!< HRPWM0_CSG ISTAT: STDS (Bit 5)                              */
#define HRPWM0_CSG_ISTAT_STDS_Msk             (0x20UL)                  /*!< HRPWM0_CSG ISTAT: STDS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG_ISTAT_CRSS_Pos             (6UL)                     /*!< HRPWM0_CSG ISTAT: CRSS (Bit 6)                              */
#define HRPWM0_CSG_ISTAT_CRSS_Msk             (0x40UL)                  /*!< HRPWM0_CSG ISTAT: CRSS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG_ISTAT_CFSS_Pos             (7UL)                     /*!< HRPWM0_CSG ISTAT: CFSS (Bit 7)                              */
#define HRPWM0_CSG_ISTAT_CFSS_Msk             (0x80UL)                  /*!< HRPWM0_CSG ISTAT: CFSS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG_ISTAT_CSES_Pos             (8UL)                     /*!< HRPWM0_CSG ISTAT: CSES (Bit 8)                              */
#define HRPWM0_CSG_ISTAT_CSES_Msk             (0x100UL)                 /*!< HRPWM0_CSG ISTAT: CSES (Bitfield-Mask: 0x01)                */


/* ================================================================================ */
/* ================      struct 'HRPWM0_CSG0' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG0_DCI  ------------------------------ */
#define HRPWM0_CSG0_DCI_SVIS_Pos              (0UL)                     /*!< HRPWM0_CSG0 DCI: SVIS (Bit 0)                               */
#define HRPWM0_CSG0_DCI_SVIS_Msk              (0xfUL)                   /*!< HRPWM0_CSG0 DCI: SVIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG0_DCI_STRIS_Pos             (4UL)                     /*!< HRPWM0_CSG0 DCI: STRIS (Bit 4)                              */
#define HRPWM0_CSG0_DCI_STRIS_Msk             (0xf0UL)                  /*!< HRPWM0_CSG0 DCI: STRIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG0_DCI_STPIS_Pos             (8UL)                     /*!< HRPWM0_CSG0 DCI: STPIS (Bit 8)                              */
#define HRPWM0_CSG0_DCI_STPIS_Msk             (0xf00UL)                 /*!< HRPWM0_CSG0 DCI: STPIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG0_DCI_TRGIS_Pos             (12UL)                    /*!< HRPWM0_CSG0 DCI: TRGIS (Bit 12)                             */
#define HRPWM0_CSG0_DCI_TRGIS_Msk             (0xf000UL)                /*!< HRPWM0_CSG0 DCI: TRGIS (Bitfield-Mask: 0x0f)                */
#define HRPWM0_CSG0_DCI_STIS_Pos              (16UL)                    /*!< HRPWM0_CSG0 DCI: STIS (Bit 16)                              */
#define HRPWM0_CSG0_DCI_STIS_Msk              (0xf0000UL)               /*!< HRPWM0_CSG0 DCI: STIS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG0_DCI_SCS_Pos               (20UL)                    /*!< HRPWM0_CSG0 DCI: SCS (Bit 20)                               */
#define HRPWM0_CSG0_DCI_SCS_Msk               (0x300000UL)              /*!< HRPWM0_CSG0 DCI: SCS (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG0_IES  ------------------------------ */
#define HRPWM0_CSG0_IES_SVLS_Pos              (0UL)                     /*!< HRPWM0_CSG0 IES: SVLS (Bit 0)                               */
#define HRPWM0_CSG0_IES_SVLS_Msk              (0x3UL)                   /*!< HRPWM0_CSG0 IES: SVLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG0_IES_STRES_Pos             (2UL)                     /*!< HRPWM0_CSG0 IES: STRES (Bit 2)                              */
#define HRPWM0_CSG0_IES_STRES_Msk             (0xcUL)                   /*!< HRPWM0_CSG0 IES: STRES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG0_IES_STPES_Pos             (4UL)                     /*!< HRPWM0_CSG0 IES: STPES (Bit 4)                              */
#define HRPWM0_CSG0_IES_STPES_Msk             (0x30UL)                  /*!< HRPWM0_CSG0 IES: STPES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG0_IES_TRGES_Pos             (6UL)                     /*!< HRPWM0_CSG0 IES: TRGES (Bit 6)                              */
#define HRPWM0_CSG0_IES_TRGES_Msk             (0xc0UL)                  /*!< HRPWM0_CSG0 IES: TRGES (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG0_IES_STES_Pos              (8UL)                     /*!< HRPWM0_CSG0 IES: STES (Bit 8)                               */
#define HRPWM0_CSG0_IES_STES_Msk              (0x300UL)                 /*!< HRPWM0_CSG0 IES: STES (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_CSG0_SC  ------------------------------- */
#define HRPWM0_CSG0_SC_PSRM_Pos               (0UL)                     /*!< HRPWM0_CSG0 SC: PSRM (Bit 0)                                */
#define HRPWM0_CSG0_SC_PSRM_Msk               (0x3UL)                   /*!< HRPWM0_CSG0 SC: PSRM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_SC_PSTM_Pos               (2UL)                     /*!< HRPWM0_CSG0 SC: PSTM (Bit 2)                                */
#define HRPWM0_CSG0_SC_PSTM_Msk               (0xcUL)                   /*!< HRPWM0_CSG0 SC: PSTM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_SC_FPD_Pos                (4UL)                     /*!< HRPWM0_CSG0 SC: FPD (Bit 4)                                 */
#define HRPWM0_CSG0_SC_FPD_Msk                (0x10UL)                  /*!< HRPWM0_CSG0 SC: FPD (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG0_SC_PSV_Pos                (5UL)                     /*!< HRPWM0_CSG0 SC: PSV (Bit 5)                                 */
#define HRPWM0_CSG0_SC_PSV_Msk                (0x60UL)                  /*!< HRPWM0_CSG0 SC: PSV (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG0_SC_SCM_Pos                (8UL)                     /*!< HRPWM0_CSG0 SC: SCM (Bit 8)                                 */
#define HRPWM0_CSG0_SC_SCM_Msk                (0x300UL)                 /*!< HRPWM0_CSG0 SC: SCM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG0_SC_SSRM_Pos               (10UL)                    /*!< HRPWM0_CSG0 SC: SSRM (Bit 10)                               */
#define HRPWM0_CSG0_SC_SSRM_Msk               (0xc00UL)                 /*!< HRPWM0_CSG0 SC: SSRM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_SC_SSTM_Pos               (12UL)                    /*!< HRPWM0_CSG0 SC: SSTM (Bit 12)                               */
#define HRPWM0_CSG0_SC_SSTM_Msk               (0x3000UL)                /*!< HRPWM0_CSG0 SC: SSTM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_SC_SVSC_Pos               (14UL)                    /*!< HRPWM0_CSG0 SC: SVSC (Bit 14)                               */
#define HRPWM0_CSG0_SC_SVSC_Msk               (0xc000UL)                /*!< HRPWM0_CSG0 SC: SVSC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_SC_SWSM_Pos               (16UL)                    /*!< HRPWM0_CSG0 SC: SWSM (Bit 16)                               */
#define HRPWM0_CSG0_SC_SWSM_Msk               (0x30000UL)               /*!< HRPWM0_CSG0 SC: SWSM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_SC_GCFG_Pos               (18UL)                    /*!< HRPWM0_CSG0 SC: GCFG (Bit 18)                               */
#define HRPWM0_CSG0_SC_GCFG_Msk               (0xc0000UL)               /*!< HRPWM0_CSG0 SC: GCFG (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG0_SC_IST_Pos                (20UL)                    /*!< HRPWM0_CSG0 SC: IST (Bit 20)                                */
#define HRPWM0_CSG0_SC_IST_Msk                (0x100000UL)              /*!< HRPWM0_CSG0 SC: IST (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG0_SC_PSE_Pos                (21UL)                    /*!< HRPWM0_CSG0 SC: PSE (Bit 21)                                */
#define HRPWM0_CSG0_SC_PSE_Msk                (0x200000UL)              /*!< HRPWM0_CSG0 SC: PSE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG0_SC_PSWM_Pos               (24UL)                    /*!< HRPWM0_CSG0 SC: PSWM (Bit 24)                               */
#define HRPWM0_CSG0_SC_PSWM_Msk               (0x3000000UL)             /*!< HRPWM0_CSG0 SC: PSWM (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG0_PC  ------------------------------- */
#define HRPWM0_CSG0_PC_PSWV_Pos               (0UL)                     /*!< HRPWM0_CSG0 PC: PSWV (Bit 0)                                */
#define HRPWM0_CSG0_PC_PSWV_Msk               (0x3fUL)                  /*!< HRPWM0_CSG0 PC: PSWV (Bitfield-Mask: 0x3f)                  */

