MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4402-F100K256/mcu.h
/* -------------------------------  HRPWM0_CSG2_SC  ------------------------------- */
#define HRPWM0_CSG2_SC_PSRM_Pos               (0UL)                     /*!< HRPWM0_CSG2 SC: PSRM (Bit 0)                                */
#define HRPWM0_CSG2_SC_PSRM_Msk               (0x3UL)                   /*!< HRPWM0_CSG2 SC: PSRM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_SC_PSTM_Pos               (2UL)                     /*!< HRPWM0_CSG2 SC: PSTM (Bit 2)                                */
#define HRPWM0_CSG2_SC_PSTM_Msk               (0xcUL)                   /*!< HRPWM0_CSG2 SC: PSTM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_SC_FPD_Pos                (4UL)                     /*!< HRPWM0_CSG2 SC: FPD (Bit 4)                                 */
#define HRPWM0_CSG2_SC_FPD_Msk                (0x10UL)                  /*!< HRPWM0_CSG2 SC: FPD (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG2_SC_PSV_Pos                (5UL)                     /*!< HRPWM0_CSG2 SC: PSV (Bit 5)                                 */
#define HRPWM0_CSG2_SC_PSV_Msk                (0x60UL)                  /*!< HRPWM0_CSG2 SC: PSV (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG2_SC_SCM_Pos                (8UL)                     /*!< HRPWM0_CSG2 SC: SCM (Bit 8)                                 */
#define HRPWM0_CSG2_SC_SCM_Msk                (0x300UL)                 /*!< HRPWM0_CSG2 SC: SCM (Bitfield-Mask: 0x03)                   */
#define HRPWM0_CSG2_SC_SSRM_Pos               (10UL)                    /*!< HRPWM0_CSG2 SC: SSRM (Bit 10)                               */
#define HRPWM0_CSG2_SC_SSRM_Msk               (0xc00UL)                 /*!< HRPWM0_CSG2 SC: SSRM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_SC_SSTM_Pos               (12UL)                    /*!< HRPWM0_CSG2 SC: SSTM (Bit 12)                               */
#define HRPWM0_CSG2_SC_SSTM_Msk               (0x3000UL)                /*!< HRPWM0_CSG2 SC: SSTM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_SC_SVSC_Pos               (14UL)                    /*!< HRPWM0_CSG2 SC: SVSC (Bit 14)                               */
#define HRPWM0_CSG2_SC_SVSC_Msk               (0xc000UL)                /*!< HRPWM0_CSG2 SC: SVSC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_SC_SWSM_Pos               (16UL)                    /*!< HRPWM0_CSG2 SC: SWSM (Bit 16)                               */
#define HRPWM0_CSG2_SC_SWSM_Msk               (0x30000UL)               /*!< HRPWM0_CSG2 SC: SWSM (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_SC_GCFG_Pos               (18UL)                    /*!< HRPWM0_CSG2 SC: GCFG (Bit 18)                               */
#define HRPWM0_CSG2_SC_GCFG_Msk               (0xc0000UL)               /*!< HRPWM0_CSG2 SC: GCFG (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_SC_IST_Pos                (20UL)                    /*!< HRPWM0_CSG2 SC: IST (Bit 20)                                */
#define HRPWM0_CSG2_SC_IST_Msk                (0x100000UL)              /*!< HRPWM0_CSG2 SC: IST (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG2_SC_PSE_Pos                (21UL)                    /*!< HRPWM0_CSG2 SC: PSE (Bit 21)                                */
#define HRPWM0_CSG2_SC_PSE_Msk                (0x200000UL)              /*!< HRPWM0_CSG2 SC: PSE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG2_SC_PSWM_Pos               (24UL)                    /*!< HRPWM0_CSG2 SC: PSWM (Bit 24)                               */
#define HRPWM0_CSG2_SC_PSWM_Msk               (0x3000000UL)             /*!< HRPWM0_CSG2 SC: PSWM (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG2_PC  ------------------------------- */
#define HRPWM0_CSG2_PC_PSWV_Pos               (0UL)                     /*!< HRPWM0_CSG2 PC: PSWV (Bit 0)                                */
#define HRPWM0_CSG2_PC_PSWV_Msk               (0x3fUL)                  /*!< HRPWM0_CSG2 PC: PSWV (Bitfield-Mask: 0x3f)                  */

/* ------------------------------  HRPWM0_CSG2_DSV1  ------------------------------ */
#define HRPWM0_CSG2_DSV1_DSV1_Pos             (0UL)                     /*!< HRPWM0_CSG2 DSV1: DSV1 (Bit 0)                              */
#define HRPWM0_CSG2_DSV1_DSV1_Msk             (0x3ffUL)                 /*!< HRPWM0_CSG2 DSV1: DSV1 (Bitfield-Mask: 0x3ff)               */

/* ------------------------------  HRPWM0_CSG2_DSV2  ------------------------------ */
#define HRPWM0_CSG2_DSV2_DSV2_Pos             (0UL)                     /*!< HRPWM0_CSG2 DSV2: DSV2 (Bit 0)                              */
#define HRPWM0_CSG2_DSV2_DSV2_Msk             (0x3ffUL)                 /*!< HRPWM0_CSG2 DSV2: DSV2 (Bitfield-Mask: 0x3ff)               */

/* ------------------------------  HRPWM0_CSG2_SDSV1  ----------------------------- */
#define HRPWM0_CSG2_SDSV1_SDSV1_Pos           (0UL)                     /*!< HRPWM0_CSG2 SDSV1: SDSV1 (Bit 0)                            */
#define HRPWM0_CSG2_SDSV1_SDSV1_Msk           (0x3ffUL)                 /*!< HRPWM0_CSG2 SDSV1: SDSV1 (Bitfield-Mask: 0x3ff)             */

/* -------------------------------  HRPWM0_CSG2_SPC  ------------------------------ */
#define HRPWM0_CSG2_SPC_SPSWV_Pos             (0UL)                     /*!< HRPWM0_CSG2 SPC: SPSWV (Bit 0)                              */
#define HRPWM0_CSG2_SPC_SPSWV_Msk             (0x3fUL)                  /*!< HRPWM0_CSG2 SPC: SPSWV (Bitfield-Mask: 0x3f)                */

/* -------------------------------  HRPWM0_CSG2_CC  ------------------------------- */
#define HRPWM0_CSG2_CC_IBS_Pos                (0UL)                     /*!< HRPWM0_CSG2 CC: IBS (Bit 0)                                 */
#define HRPWM0_CSG2_CC_IBS_Msk                (0xfUL)                   /*!< HRPWM0_CSG2 CC: IBS (Bitfield-Mask: 0x0f)                   */
#define HRPWM0_CSG2_CC_IMCS_Pos               (8UL)                     /*!< HRPWM0_CSG2 CC: IMCS (Bit 8)                                */
#define HRPWM0_CSG2_CC_IMCS_Msk               (0x100UL)                 /*!< HRPWM0_CSG2 CC: IMCS (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG2_CC_IMCC_Pos               (9UL)                     /*!< HRPWM0_CSG2 CC: IMCC (Bit 9)                                */
#define HRPWM0_CSG2_CC_IMCC_Msk               (0x600UL)                 /*!< HRPWM0_CSG2 CC: IMCC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_CC_ESE_Pos                (11UL)                    /*!< HRPWM0_CSG2 CC: ESE (Bit 11)                                */
#define HRPWM0_CSG2_CC_ESE_Msk                (0x800UL)                 /*!< HRPWM0_CSG2 CC: ESE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG2_CC_OIE_Pos                (12UL)                    /*!< HRPWM0_CSG2 CC: OIE (Bit 12)                                */
#define HRPWM0_CSG2_CC_OIE_Msk                (0x1000UL)                /*!< HRPWM0_CSG2 CC: OIE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG2_CC_OSE_Pos                (13UL)                    /*!< HRPWM0_CSG2 CC: OSE (Bit 13)                                */
#define HRPWM0_CSG2_CC_OSE_Msk                (0x2000UL)                /*!< HRPWM0_CSG2 CC: OSE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG2_CC_BLMC_Pos               (14UL)                    /*!< HRPWM0_CSG2 CC: BLMC (Bit 14)                               */
#define HRPWM0_CSG2_CC_BLMC_Msk               (0xc000UL)                /*!< HRPWM0_CSG2 CC: BLMC (Bitfield-Mask: 0x03)                  */
#define HRPWM0_CSG2_CC_EBE_Pos                (16UL)                    /*!< HRPWM0_CSG2 CC: EBE (Bit 16)                                */
#define HRPWM0_CSG2_CC_EBE_Msk                (0x10000UL)               /*!< HRPWM0_CSG2 CC: EBE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_CSG2_CC_COFE_Pos               (17UL)                    /*!< HRPWM0_CSG2 CC: COFE (Bit 17)                               */
#define HRPWM0_CSG2_CC_COFE_Msk               (0x20000UL)               /*!< HRPWM0_CSG2 CC: COFE (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG2_CC_COFM_Pos               (18UL)                    /*!< HRPWM0_CSG2 CC: COFM (Bit 18)                               */
#define HRPWM0_CSG2_CC_COFM_Msk               (0x3c0000UL)              /*!< HRPWM0_CSG2 CC: COFM (Bitfield-Mask: 0x0f)                  */
#define HRPWM0_CSG2_CC_COFC_Pos               (24UL)                    /*!< HRPWM0_CSG2 CC: COFC (Bit 24)                               */
#define HRPWM0_CSG2_CC_COFC_Msk               (0x3000000UL)             /*!< HRPWM0_CSG2 CC: COFC (Bitfield-Mask: 0x03)                  */

/* -------------------------------  HRPWM0_CSG2_PLC  ------------------------------ */
#define HRPWM0_CSG2_PLC_IPLS_Pos              (0UL)                     /*!< HRPWM0_CSG2 PLC: IPLS (Bit 0)                               */
#define HRPWM0_CSG2_PLC_IPLS_Msk              (0xfUL)                   /*!< HRPWM0_CSG2 PLC: IPLS (Bitfield-Mask: 0x0f)                 */
#define HRPWM0_CSG2_PLC_PLCL_Pos              (8UL)                     /*!< HRPWM0_CSG2 PLC: PLCL (Bit 8)                               */
#define HRPWM0_CSG2_PLC_PLCL_Msk              (0x300UL)                 /*!< HRPWM0_CSG2 PLC: PLCL (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG2_PLC_PSL_Pos               (10UL)                    /*!< HRPWM0_CSG2 PLC: PSL (Bit 10)                               */
#define HRPWM0_CSG2_PLC_PSL_Msk               (0x400UL)                 /*!< HRPWM0_CSG2 PLC: PSL (Bitfield-Mask: 0x01)                  */
#define HRPWM0_CSG2_PLC_PLSW_Pos              (11UL)                    /*!< HRPWM0_CSG2 PLC: PLSW (Bit 11)                              */
#define HRPWM0_CSG2_PLC_PLSW_Msk              (0x800UL)                 /*!< HRPWM0_CSG2 PLC: PLSW (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_PLC_PLEC_Pos              (12UL)                    /*!< HRPWM0_CSG2 PLC: PLEC (Bit 12)                              */
#define HRPWM0_CSG2_PLC_PLEC_Msk              (0x3000UL)                /*!< HRPWM0_CSG2 PLC: PLEC (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG2_PLC_PLXC_Pos              (14UL)                    /*!< HRPWM0_CSG2 PLC: PLXC (Bit 14)                              */
#define HRPWM0_CSG2_PLC_PLXC_Msk              (0xc000UL)                /*!< HRPWM0_CSG2 PLC: PLXC (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_CSG2_BLV  ------------------------------ */
#define HRPWM0_CSG2_BLV_BLV_Pos               (0UL)                     /*!< HRPWM0_CSG2 BLV: BLV (Bit 0)                                */
#define HRPWM0_CSG2_BLV_BLV_Msk               (0xffUL)                  /*!< HRPWM0_CSG2 BLV: BLV (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_CSG2_SRE  ------------------------------ */
#define HRPWM0_CSG2_SRE_VLS1E_Pos             (0UL)                     /*!< HRPWM0_CSG2 SRE: VLS1E (Bit 0)                              */
#define HRPWM0_CSG2_SRE_VLS1E_Msk             (0x1UL)                   /*!< HRPWM0_CSG2 SRE: VLS1E (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SRE_VLS2E_Pos             (1UL)                     /*!< HRPWM0_CSG2 SRE: VLS2E (Bit 1)                              */
#define HRPWM0_CSG2_SRE_VLS2E_Msk             (0x2UL)                   /*!< HRPWM0_CSG2 SRE: VLS2E (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SRE_TRGSE_Pos             (2UL)                     /*!< HRPWM0_CSG2 SRE: TRGSE (Bit 2)                              */
#define HRPWM0_CSG2_SRE_TRGSE_Msk             (0x4UL)                   /*!< HRPWM0_CSG2 SRE: TRGSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SRE_STRSE_Pos             (3UL)                     /*!< HRPWM0_CSG2 SRE: STRSE (Bit 3)                              */
#define HRPWM0_CSG2_SRE_STRSE_Msk             (0x8UL)                   /*!< HRPWM0_CSG2 SRE: STRSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SRE_STPSE_Pos             (4UL)                     /*!< HRPWM0_CSG2 SRE: STPSE (Bit 4)                              */
#define HRPWM0_CSG2_SRE_STPSE_Msk             (0x10UL)                  /*!< HRPWM0_CSG2 SRE: STPSE (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SRE_STDE_Pos              (5UL)                     /*!< HRPWM0_CSG2 SRE: STDE (Bit 5)                               */
#define HRPWM0_CSG2_SRE_STDE_Msk              (0x20UL)                  /*!< HRPWM0_CSG2 SRE: STDE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SRE_CRSE_Pos              (6UL)                     /*!< HRPWM0_CSG2 SRE: CRSE (Bit 6)                               */
#define HRPWM0_CSG2_SRE_CRSE_Msk              (0x40UL)                  /*!< HRPWM0_CSG2 SRE: CRSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SRE_CFSE_Pos              (7UL)                     /*!< HRPWM0_CSG2 SRE: CFSE (Bit 7)                               */
#define HRPWM0_CSG2_SRE_CFSE_Msk              (0x80UL)                  /*!< HRPWM0_CSG2 SRE: CFSE (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SRE_CSEE_Pos              (8UL)                     /*!< HRPWM0_CSG2 SRE: CSEE (Bit 8)                               */
#define HRPWM0_CSG2_SRE_CSEE_Msk              (0x100UL)                 /*!< HRPWM0_CSG2 SRE: CSEE (Bitfield-Mask: 0x01)                 */

/* -------------------------------  HRPWM0_CSG2_SRS  ------------------------------ */
#define HRPWM0_CSG2_SRS_VLS1S_Pos             (0UL)                     /*!< HRPWM0_CSG2 SRS: VLS1S (Bit 0)                              */
#define HRPWM0_CSG2_SRS_VLS1S_Msk             (0x3UL)                   /*!< HRPWM0_CSG2 SRS: VLS1S (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG2_SRS_VLS2S_Pos             (2UL)                     /*!< HRPWM0_CSG2 SRS: VLS2S (Bit 2)                              */
#define HRPWM0_CSG2_SRS_VLS2S_Msk             (0xcUL)                   /*!< HRPWM0_CSG2 SRS: VLS2S (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG2_SRS_TRLS_Pos              (4UL)                     /*!< HRPWM0_CSG2 SRS: TRLS (Bit 4)                               */
#define HRPWM0_CSG2_SRS_TRLS_Msk              (0x30UL)                  /*!< HRPWM0_CSG2 SRS: TRLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG2_SRS_SSLS_Pos              (6UL)                     /*!< HRPWM0_CSG2 SRS: SSLS (Bit 6)                               */
#define HRPWM0_CSG2_SRS_SSLS_Msk              (0xc0UL)                  /*!< HRPWM0_CSG2 SRS: SSLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG2_SRS_STLS_Pos              (8UL)                     /*!< HRPWM0_CSG2 SRS: STLS (Bit 8)                               */
#define HRPWM0_CSG2_SRS_STLS_Msk              (0x300UL)                 /*!< HRPWM0_CSG2 SRS: STLS (Bitfield-Mask: 0x03)                 */
#define HRPWM0_CSG2_SRS_CRFLS_Pos             (10UL)                    /*!< HRPWM0_CSG2 SRS: CRFLS (Bit 10)                             */
#define HRPWM0_CSG2_SRS_CRFLS_Msk             (0xc00UL)                 /*!< HRPWM0_CSG2 SRS: CRFLS (Bitfield-Mask: 0x03)                */
#define HRPWM0_CSG2_SRS_CSLS_Pos              (12UL)                    /*!< HRPWM0_CSG2 SRS: CSLS (Bit 12)                              */
#define HRPWM0_CSG2_SRS_CSLS_Msk              (0x3000UL)                /*!< HRPWM0_CSG2 SRS: CSLS (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_CSG2_SWS  ------------------------------ */
#define HRPWM0_CSG2_SWS_SVLS1_Pos             (0UL)                     /*!< HRPWM0_CSG2 SWS: SVLS1 (Bit 0)                              */
#define HRPWM0_CSG2_SWS_SVLS1_Msk             (0x1UL)                   /*!< HRPWM0_CSG2 SWS: SVLS1 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWS_SVLS2_Pos             (1UL)                     /*!< HRPWM0_CSG2 SWS: SVLS2 (Bit 1)                              */
#define HRPWM0_CSG2_SWS_SVLS2_Msk             (0x2UL)                   /*!< HRPWM0_CSG2 SWS: SVLS2 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWS_STRGS_Pos             (2UL)                     /*!< HRPWM0_CSG2 SWS: STRGS (Bit 2)                              */
#define HRPWM0_CSG2_SWS_STRGS_Msk             (0x4UL)                   /*!< HRPWM0_CSG2 SWS: STRGS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWS_SSTRS_Pos             (3UL)                     /*!< HRPWM0_CSG2 SWS: SSTRS (Bit 3)                              */
#define HRPWM0_CSG2_SWS_SSTRS_Msk             (0x8UL)                   /*!< HRPWM0_CSG2 SWS: SSTRS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWS_SSTPS_Pos             (4UL)                     /*!< HRPWM0_CSG2 SWS: SSTPS (Bit 4)                              */
#define HRPWM0_CSG2_SWS_SSTPS_Msk             (0x10UL)                  /*!< HRPWM0_CSG2 SWS: SSTPS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWS_SSTD_Pos              (5UL)                     /*!< HRPWM0_CSG2 SWS: SSTD (Bit 5)                               */
#define HRPWM0_CSG2_SWS_SSTD_Msk              (0x20UL)                  /*!< HRPWM0_CSG2 SWS: SSTD (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SWS_SCRS_Pos              (6UL)                     /*!< HRPWM0_CSG2 SWS: SCRS (Bit 6)                               */
#define HRPWM0_CSG2_SWS_SCRS_Msk              (0x40UL)                  /*!< HRPWM0_CSG2 SWS: SCRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SWS_SCFS_Pos              (7UL)                     /*!< HRPWM0_CSG2 SWS: SCFS (Bit 7)                               */
#define HRPWM0_CSG2_SWS_SCFS_Msk              (0x80UL)                  /*!< HRPWM0_CSG2 SWS: SCFS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SWS_SCSS_Pos              (8UL)                     /*!< HRPWM0_CSG2 SWS: SCSS (Bit 8)                               */
#define HRPWM0_CSG2_SWS_SCSS_Msk              (0x100UL)                 /*!< HRPWM0_CSG2 SWS: SCSS (Bitfield-Mask: 0x01)                 */

/* -------------------------------  HRPWM0_CSG2_SWC  ------------------------------ */
#define HRPWM0_CSG2_SWC_CVLS1_Pos             (0UL)                     /*!< HRPWM0_CSG2 SWC: CVLS1 (Bit 0)                              */
#define HRPWM0_CSG2_SWC_CVLS1_Msk             (0x1UL)                   /*!< HRPWM0_CSG2 SWC: CVLS1 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWC_CVLS2_Pos             (1UL)                     /*!< HRPWM0_CSG2 SWC: CVLS2 (Bit 1)                              */
#define HRPWM0_CSG2_SWC_CVLS2_Msk             (0x2UL)                   /*!< HRPWM0_CSG2 SWC: CVLS2 (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWC_CTRGS_Pos             (2UL)                     /*!< HRPWM0_CSG2 SWC: CTRGS (Bit 2)                              */
#define HRPWM0_CSG2_SWC_CTRGS_Msk             (0x4UL)                   /*!< HRPWM0_CSG2 SWC: CTRGS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWC_CSTRS_Pos             (3UL)                     /*!< HRPWM0_CSG2 SWC: CSTRS (Bit 3)                              */
#define HRPWM0_CSG2_SWC_CSTRS_Msk             (0x8UL)                   /*!< HRPWM0_CSG2 SWC: CSTRS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWC_CSTPS_Pos             (4UL)                     /*!< HRPWM0_CSG2 SWC: CSTPS (Bit 4)                              */
#define HRPWM0_CSG2_SWC_CSTPS_Msk             (0x10UL)                  /*!< HRPWM0_CSG2 SWC: CSTPS (Bitfield-Mask: 0x01)                */
#define HRPWM0_CSG2_SWC_CSTD_Pos              (5UL)                     /*!< HRPWM0_CSG2 SWC: CSTD (Bit 5)                               */
#define HRPWM0_CSG2_SWC_CSTD_Msk              (0x20UL)                  /*!< HRPWM0_CSG2 SWC: CSTD (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SWC_CCRS_Pos              (6UL)                     /*!< HRPWM0_CSG2 SWC: CCRS (Bit 6)                               */
#define HRPWM0_CSG2_SWC_CCRS_Msk              (0x40UL)                  /*!< HRPWM0_CSG2 SWC: CCRS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SWC_CCFS_Pos              (7UL)                     /*!< HRPWM0_CSG2 SWC: CCFS (Bit 7)                               */
#define HRPWM0_CSG2_SWC_CCFS_Msk              (0x80UL)                  /*!< HRPWM0_CSG2 SWC: CCFS (Bitfield-Mask: 0x01)                 */
#define HRPWM0_CSG2_SWC_CCSS_Pos              (8UL)                     /*!< HRPWM0_CSG2 SWC: CCSS (Bit 8)                               */
#define HRPWM0_CSG2_SWC_CCSS_Msk              (0x100UL)                 /*!< HRPWM0_CSG2 SWC: CCSS (Bitfield-Mask: 0x01)                 */

