MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4402-F100K256/mcu.h
/* ------------------------------  HRPWM0_HRC2_TSEL  ------------------------------ */
#define HRPWM0_HRC2_TSEL_TSEL0_Pos            (0UL)                     /*!< HRPWM0_HRC2 TSEL: TSEL0 (Bit 0)                             */
#define HRPWM0_HRC2_TSEL_TSEL0_Msk            (0x7UL)                   /*!< HRPWM0_HRC2 TSEL: TSEL0 (Bitfield-Mask: 0x07)               */
#define HRPWM0_HRC2_TSEL_TSEL1_Pos            (3UL)                     /*!< HRPWM0_HRC2 TSEL: TSEL1 (Bit 3)                             */
#define HRPWM0_HRC2_TSEL_TSEL1_Msk            (0x38UL)                  /*!< HRPWM0_HRC2 TSEL: TSEL1 (Bitfield-Mask: 0x07)               */
#define HRPWM0_HRC2_TSEL_TS0E_Pos             (16UL)                    /*!< HRPWM0_HRC2 TSEL: TS0E (Bit 16)                             */
#define HRPWM0_HRC2_TSEL_TS0E_Msk             (0x10000UL)               /*!< HRPWM0_HRC2 TSEL: TS0E (Bitfield-Mask: 0x01)                */
#define HRPWM0_HRC2_TSEL_TS1E_Pos             (17UL)                    /*!< HRPWM0_HRC2 TSEL: TS1E (Bit 17)                             */
#define HRPWM0_HRC2_TSEL_TS1E_Msk             (0x20000UL)               /*!< HRPWM0_HRC2 TSEL: TS1E (Bitfield-Mask: 0x01)                */

/* -------------------------------  HRPWM0_HRC2_SC  ------------------------------- */
#define HRPWM0_HRC2_SC_ST_Pos                 (0UL)                     /*!< HRPWM0_HRC2 SC: ST (Bit 0)                                  */
#define HRPWM0_HRC2_SC_ST_Msk                 (0x1UL)                   /*!< HRPWM0_HRC2 SC: ST (Bitfield-Mask: 0x01)                    */

/* -------------------------------  HRPWM0_HRC2_DCR  ------------------------------ */
#define HRPWM0_HRC2_DCR_DTRV_Pos              (0UL)                     /*!< HRPWM0_HRC2 DCR: DTRV (Bit 0)                               */
#define HRPWM0_HRC2_DCR_DTRV_Msk              (0xffffUL)                /*!< HRPWM0_HRC2 DCR: DTRV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC2_DCF  ------------------------------ */
#define HRPWM0_HRC2_DCF_DTFV_Pos              (0UL)                     /*!< HRPWM0_HRC2 DCF: DTFV (Bit 0)                               */
#define HRPWM0_HRC2_DCF_DTFV_Msk              (0xffffUL)                /*!< HRPWM0_HRC2 DCF: DTFV (Bitfield-Mask: 0xffff)               */

/* -------------------------------  HRPWM0_HRC2_CR1  ------------------------------ */
#define HRPWM0_HRC2_CR1_CR1_Pos               (0UL)                     /*!< HRPWM0_HRC2 CR1: CR1 (Bit 0)                                */
#define HRPWM0_HRC2_CR1_CR1_Msk               (0xffUL)                  /*!< HRPWM0_HRC2 CR1: CR1 (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_HRC2_CR2  ------------------------------ */
#define HRPWM0_HRC2_CR2_CR2_Pos               (0UL)                     /*!< HRPWM0_HRC2 CR2: CR2 (Bit 0)                                */
#define HRPWM0_HRC2_CR2_CR2_Msk               (0xffUL)                  /*!< HRPWM0_HRC2 CR2: CR2 (Bitfield-Mask: 0xff)                  */

/* -------------------------------  HRPWM0_HRC2_SSC  ------------------------------ */
#define HRPWM0_HRC2_SSC_SST_Pos               (0UL)                     /*!< HRPWM0_HRC2 SSC: SST (Bit 0)                                */
#define HRPWM0_HRC2_SSC_SST_Msk               (0x1UL)                   /*!< HRPWM0_HRC2 SSC: SST (Bitfield-Mask: 0x01)                  */

/* ------------------------------  HRPWM0_HRC2_SDCR  ------------------------------ */
#define HRPWM0_HRC2_SDCR_SDTRV_Pos            (0UL)                     /*!< HRPWM0_HRC2 SDCR: SDTRV (Bit 0)                             */
#define HRPWM0_HRC2_SDCR_SDTRV_Msk            (0xffffUL)                /*!< HRPWM0_HRC2 SDCR: SDTRV (Bitfield-Mask: 0xffff)             */

/* ------------------------------  HRPWM0_HRC2_SDCF  ------------------------------ */
#define HRPWM0_HRC2_SDCF_SDTFV_Pos            (0UL)                     /*!< HRPWM0_HRC2 SDCF: SDTFV (Bit 0)                             */
#define HRPWM0_HRC2_SDCF_SDTFV_Msk            (0xffffUL)                /*!< HRPWM0_HRC2 SDCF: SDTFV (Bitfield-Mask: 0xffff)             */

/* ------------------------------  HRPWM0_HRC2_SCR1  ------------------------------ */
#define HRPWM0_HRC2_SCR1_SCR1_Pos             (0UL)                     /*!< HRPWM0_HRC2 SCR1: SCR1 (Bit 0)                              */
#define HRPWM0_HRC2_SCR1_SCR1_Msk             (0xffUL)                  /*!< HRPWM0_HRC2 SCR1: SCR1 (Bitfield-Mask: 0xff)                */

/* ------------------------------  HRPWM0_HRC2_SCR2  ------------------------------ */
#define HRPWM0_HRC2_SCR2_SCR2_Pos             (0UL)                     /*!< HRPWM0_HRC2 SCR2: SCR2 (Bit 0)                              */
#define HRPWM0_HRC2_SCR2_SCR2_Msk             (0xffUL)                  /*!< HRPWM0_HRC2 SCR2: SCR2 (Bitfield-Mask: 0xff)                */


/* ================================================================================ */
/* ================      struct 'HRPWM0_HRC3' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_HRC3_GC  ------------------------------- */
#define HRPWM0_HRC3_GC_HRM0_Pos               (0UL)                     /*!< HRPWM0_HRC3 GC: HRM0 (Bit 0)                                */
#define HRPWM0_HRC3_GC_HRM0_Msk               (0x3UL)                   /*!< HRPWM0_HRC3 GC: HRM0 (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC3_GC_HRM1_Pos               (2UL)                     /*!< HRPWM0_HRC3 GC: HRM1 (Bit 2)                                */
#define HRPWM0_HRC3_GC_HRM1_Msk               (0xcUL)                   /*!< HRPWM0_HRC3 GC: HRM1 (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC3_GC_DTE_Pos                (8UL)                     /*!< HRPWM0_HRC3 GC: DTE (Bit 8)                                 */
#define HRPWM0_HRC3_GC_DTE_Msk                (0x100UL)                 /*!< HRPWM0_HRC3 GC: DTE (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC3_GC_TR0E_Pos               (9UL)                     /*!< HRPWM0_HRC3 GC: TR0E (Bit 9)                                */
#define HRPWM0_HRC3_GC_TR0E_Msk               (0x200UL)                 /*!< HRPWM0_HRC3 GC: TR0E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC3_GC_TR1E_Pos               (10UL)                    /*!< HRPWM0_HRC3 GC: TR1E (Bit 10)                               */
#define HRPWM0_HRC3_GC_TR1E_Msk               (0x400UL)                 /*!< HRPWM0_HRC3 GC: TR1E (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC3_GC_STC_Pos                (11UL)                    /*!< HRPWM0_HRC3 GC: STC (Bit 11)                                */
#define HRPWM0_HRC3_GC_STC_Msk                (0x800UL)                 /*!< HRPWM0_HRC3 GC: STC (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC3_GC_DSTC_Pos               (12UL)                    /*!< HRPWM0_HRC3 GC: DSTC (Bit 12)                               */
#define HRPWM0_HRC3_GC_DSTC_Msk               (0x1000UL)                /*!< HRPWM0_HRC3 GC: DSTC (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC3_GC_OCS0_Pos               (13UL)                    /*!< HRPWM0_HRC3 GC: OCS0 (Bit 13)                               */
#define HRPWM0_HRC3_GC_OCS0_Msk               (0x2000UL)                /*!< HRPWM0_HRC3 GC: OCS0 (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC3_GC_OCS1_Pos               (14UL)                    /*!< HRPWM0_HRC3 GC: OCS1 (Bit 14)                               */
#define HRPWM0_HRC3_GC_OCS1_Msk               (0x4000UL)                /*!< HRPWM0_HRC3 GC: OCS1 (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC3_GC_DTUS_Pos               (16UL)                    /*!< HRPWM0_HRC3 GC: DTUS (Bit 16)                               */
#define HRPWM0_HRC3_GC_DTUS_Msk               (0x10000UL)               /*!< HRPWM0_HRC3 GC: DTUS (Bitfield-Mask: 0x01)                  */

/* -------------------------------  HRPWM0_HRC3_PL  ------------------------------- */
#define HRPWM0_HRC3_PL_PSL0_Pos               (0UL)                     /*!< HRPWM0_HRC3 PL: PSL0 (Bit 0)                                */
#define HRPWM0_HRC3_PL_PSL0_Msk               (0x1UL)                   /*!< HRPWM0_HRC3 PL: PSL0 (Bitfield-Mask: 0x01)                  */
#define HRPWM0_HRC3_PL_PSL1_Pos               (1UL)                     /*!< HRPWM0_HRC3 PL: PSL1 (Bit 1)                                */
#define HRPWM0_HRC3_PL_PSL1_Msk               (0x2UL)                   /*!< HRPWM0_HRC3 PL: PSL1 (Bitfield-Mask: 0x01)                  */

